import { Component } from '@angular/core';

@Component({
    selector: 'app-eap0001scr02',
    templateUrl: './eap0001scr02.component.html',
    styleUrl: './eap0001scr02.component.scss',
    standalone: false
})
export class Eap0001scr02Component {
  selectedOption: string = "Y";
  chk: string = "N"

  data = [
    { doc: "ใบคำขอเอาประกัน", flag: "" },
    { doc: "ใบเสนอขาย", flag: "" },
    { doc: "เอกสารยืนยันตัวบุคคล", flag: "" },
    { doc: "หนังสือยินยอมให้ธนาคารหักบัญชีจากบัญชีเงินฝาก (กรณีต้องชำระค่าเบี้ยประกันต่ออายุโดยการหักเงินจากบัญชีเงินฝาก)", flag: "" },
    { doc: "หนังสือยินยอมให้เรียกเก็บเงินผ่านบัตรเครดิต", flag: "" },
    { doc: "หนังสือแจ้งความประสงค์ขอรับเงินผลประโยชน์ตามกรมธรรม์และเงินอื่นๆ ผ่านธนาคาร", flag: "" },
    { doc: "สำเนาหน้าสมุดบัญชีธนาคาร", flag: "" },
    { doc: "เอกสารแสดงความสัมพันธ์ของผู้เอาประกันและผู้รับผลประโยชน์ เช่น สำเนาทะเบียนบ้าน ใบเปลี่ยนชื่อ-นามสกุล ฯลฯ", flag: "" },
    { doc: "เอกสาร Pay Slip ATM", flag: "" },
    { doc: "ผลตรวจสุขภาพตามตารางมาตราฐานการตรวจสุขภาพ", flag: "" },
    { doc: "สำเนาประวัติการรักษา ถ้อยแถลงโรค", flag: "" },
    { doc: "ประวัติการตรวจสุขภาพ", flag: "" },
    { doc: "แบบสอบถามสถานะทางการเงิน (LAQ,FQ)", flag: "" },
    { doc: "BANK STATEMENT ย้อนหลัง 6 เดือน", flag: "" },
    { doc: "สำเนาหนังสือจดทะเบียนการค้า (กรณีเป็นเจ้าของกิจการ)", flag: "" },
    { doc: "งบดุล และงบกำไรขาดทุนย้อนหลัง 3 ปี (กรณีเป็นเจ้าของกิจการ)", flag: "" },
    { doc: "งบประมาณการล่วงหน้า", flag: "" },
    { doc: "ผลการวิเคราะห์เครดิตทางการเงินของธนาคาร", flag: "" },
    { doc: "บันทึกขอออกใบเสร็จในนามบริษัท", flag: "" },
    { doc: "สำเนาสัญญาการกู้เงินจากสถาบันทางการเงิน", flag: "" },
    { doc: "Visa", flag: "" },
    { doc: "Work permit", flag: "" },
    { doc: "แบบฟอร์มฝ่ายขายขอรับกรมธรรม์", flag: "" },
    { doc: "แบบฟอร์มขอรับกรมธรรม์ผ่านสาขาธนาคาร", flag: "" }

  ]
}
