import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class OccupationService {

  items = [
      {code:"111", desc: "วิศวกรไฟฟ้า ควบคุม ทำการติดตั้ง,วิศวะ", group: "วิศวกร", as400:"20", level:"2"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"},
      {code:"222", desc: "เจ้าหน้าที่วางสายใต้ดิน,อุโมงค์", group: "รับจ้าง", as400:"A0", level:"3"}
    ]

  constructor() { }

  getByCode(code: string) {
    return this.items.filter(item =>
      item.code.toLowerCase() === code.toLowerCase()
    )
  }

  list() {
    return this.items
  }
}
