import { Component } from '@angular/core';

@Component({
    selector: 'app-eap0001scr07',
    templateUrl: './eap0001scr07.component.html',
    styleUrl: './eap0001scr07.component.css',
    standalone: false
})
export class Eap0001scr07Component {
  data = [
    {subject:"008:06-02",question:"6.2 การขอเอาประกันภัย/การต่ออายุกรมธรรม์ประกันภัยใดๆ ของท่านเคยถูกปฏิเสธหรือเลื่อนการพิจารณาหรือเพิ่มอัตราเบี้ยประกันภัยหรือมีข้อจำกัดหรือแก้ไขทางหนึ่งทางใดหรือไม่"},
    {subject:"008:06-03",question:"6.3 ท่านเคยเป็นวัณโรค โรคมะเร็ง เบาหวาน แผลในกระเพาะ โรคหัวใจ โรคความดันโลหิตสูง หรือโรคเกี่ยวกับสมองหรือไม่"},
    {subject:"008:06-04",question:"6.4 ท่านเคยใช้ยาเสพติดให้โทษ หรือดื่มสุรา หรือสิ่งมึนเมา หรือเครื่องดื่มแอลกอฮอล์เป็นประจำหรือเคยรับการรักษาเกี่ยวกับโรคพิษสุราเรื้อรัง หรือยาเสพติดให้โทษบ้างหรือไม่"},
    {subject:"008:06-05",question:"6.5 ในช่วงระยะ 5 ปีที่ผ่านมา ท่านเคยปรึกษาแพทย์ หรือเข้ารับการผ่าตัด หรือเข้ารับการรักษาตัวในสถานพยาบาล โรงพยาบาล หรือสถาบันที่คล้ายคลึงกันหรือไม่"}
  ]
}
